bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
        tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_2);
        switch (dvp2axi)
        {
            case DVP2AXI_E:
                *src = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_D2B_DVP_SEL_E);
                break;
            case DVP2AXI_F:
                *src = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_D2B_DVP_SEL_F);
                break;
            case DVP2AXI_G:
                *src = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_D2B_DVP_SEL_G);
                break;
            case DVP2AXI_H:
                *src = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_D2B_DVP_SEL_H);
                break;
            default:
                BL_ABORT();
        }
    }
    else {
        BL_ABORT();
    }
}

void ISP_DVP2AXI_Set_Id_Sel(DVP2AXI_Port_Type dvp2axi, DVP2AXI_ID_E id)
{
    uint32_t tmpVal;

    if (DVP2AXI_A == dvp2axi || DVP2AXI_B == dvp2axi \
        || DVP2AXI_C == dvp2axi || DVP2AXI_D == dvp2axi) {
        tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_1);

        switch (dvp2axi)
        {
        case DVP2AXI_A:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_A);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_A);
            break;
        case DVP2AXI_B:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_B);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_B);
            break;
        case DVP2AXI_C:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_C);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_C);
            break;
        case DVP2AXI_D:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_D);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_D);
            break;
        default:
            BL_ABORT();
        }
        BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_1, tmpVal);
    }
    else if (DVP2AXI_E == dvp2axi || DVP2AXI_F == dvp2axi \
        || DVP2AXI_G == dvp2axi || DVP2AXI_H == dvp2axi){
        tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_2);

        switch (dvp2axi)
        {
        case DVP2AXI_E:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_E);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_E);
            break;
        case DVP2AXI_F:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_F);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_F);
            break;
        case DVP2AXI_G:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_G);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_G);
            break;
        case DVP2AXI_H:
            if (id == DVP2AXI_ID_BAYER) tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_H);
            else tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_D2X_ID_SEL_H);
            break;
        default:
            BL_ABORT();
        }
        BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_2, tmpVal);
    }
    else {
        BL_ABORT();
    }
}

void ISP_DVP2AXI_Get_Id_Sel(DVP2AXI_Port_Type dvp2axi, DVP2AXI_ID_E *id)
{
    uint32_t tmpVal;

    if (DVP2AXI_A == dvp2axi || DVP2AXI_B == dvp2axi \
        || DVP2AXI_C == dvp2axi || DVP2AXI_D == dvp2axi) {

        tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_1);
        switch (dvp2axi)
        {
            case DVP2AXI_A:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_A)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            case DVP2AXI_B:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_B)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            case DVP2AXI_C:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_C)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            case DVP2AXI_D:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_D)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            default:
                BL_ABORT();
        }
    }
    else if (DVP2AXI_E == dvp2axi || DVP2AXI_F == dvp2axi \
        || DVP2AXI_G == dvp2axi || DVP2AXI_H == dvp2axi) {

        tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP2BUS_SRC_SEL_2);
        switch (dvp2axi)
        {
            case DVP2AXI_E:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_E)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            case DVP2AXI_F:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_F)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            case DVP2AXI_G:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_G)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            case DVP2AXI_H:
                if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_RG_D2X_ID_SEL_H)) {
                    *id = DVP2AXI_ID_YUV;
                } else {
                    *id = DVP2AXI_ID_BAYER;
                }
                break;
            default:
                BL_ABORT();
        }
    }
    else {
        BL_ABORT();
    }
}

void ISP_Intr_Clr(ISP_INTR_SEL_E intr_sel)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CLR);

    switch (intr_sel)
    {
        case ISP_AE_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AE_INT_CLR);
        break;

