bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
        case ISP_AE_HIST_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AE_HIST_INT_CLR);
        break;

        case ISP_AWB_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AWB_INT_CLR);
        break;

        case ISP_AWB2_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AWB2_INT_CLR);
        break;

        case ISP_AWB3_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AWB3_INT_CLR);
        break;

        case ISP_WDR_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_WDR_INT_CLR);
        break;

        case ISP_OSD_PB_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_OSD_PB_INT_CLR);
        break;

        case ISP_SEOF1_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF1_INT_CLR);
        break;

        case ISP_SEOF2_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF2_INT_CLR);
        break;

        case ISP_SEOF3_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF3_INT_CLR);
        break;

        case ISP_SEOF4_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF4_INT_CLR);
        break;

        case ISP_DP_SEOF0_INTR:
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_CLR);
        break;
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CLR, tmpVal);
}

void ISP_Intr_Ctrl_Init(void)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_AE_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_AE_HIST_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_AWB_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_AWB2_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_AWB3_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_WDR_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_OSD_PB_INT_MASK);

    /* Sensor VSYNC pos edge */
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_SEOF1_INT_MASK);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF1_INT_EDGE);    /* pos edge */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF1_INT_SRC, SEOF_INTR_SRC_SENSOR_VSYNC);

    /* Act VSYNC pos edge */
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_SEOF2_INT_MASK);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF2_INT_EDGE);    /* pos edge */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF2_INT_SRC, SEOF_INTR_SRC_ISP_ACT_VSYNC);

    /* Sensor VSYNC neg edge */
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_SEOF3_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_SEOF3_INT_EDGE);    /* neg edge */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF3_INT_SRC, SEOF_INTR_SRC_SENSOR_VSYNC);

    /* Act VSYNC pos edge */
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_SEOF4_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_SEOF4_INT_EDGE);    /* neg edge */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF4_INT_SRC, SEOF_INTR_SRC_ISP_ACT_VSYNC);

    /* Display edge selection */
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_MASK);
    tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_EDGE);    /* neg edge */
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_SRC, DISPLAY_INTR_SRC_TEST_SRC);

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL, tmpVal);

    ISP_Intr_Clr(ISP_AE_INTR);
    ISP_Intr_Clr(ISP_AE_HIST_INTR);
    ISP_Intr_Clr(ISP_AWB_INTR);
    ISP_Intr_Clr(ISP_AWB2_INTR);
    ISP_Intr_Clr(ISP_AWB3_INTR);
    ISP_Intr_Clr(ISP_WDR_INTR);
    ISP_Intr_Clr(ISP_OSD_PB_INTR);
    ISP_Intr_Clr(ISP_SEOF1_INTR);
    ISP_Intr_Clr(ISP_SEOF2_INTR);
    ISP_Intr_Clr(ISP_SEOF3_INTR);
    ISP_Intr_Clr(ISP_SEOF4_INTR);
    ISP_Intr_Clr(ISP_DP_SEOF0_INTR);
}

void ISP_Intr_Ctrl_Set_Src(ISP_SEOF_E seof,ISP_Seof_Intr_Src_Type selection)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL);
    if (seof == ISP_SEOF1) tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF1_INT_SRC, selection);
    else if (seof == ISP_SEOF2) tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF2_INT_SRC, selection);
    else if (seof == ISP_SEOF3) tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF3_INT_SRC, selection);
    else if (seof == ISP_SEOF4) tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF4_INT_SRC, selection);
    else if (seof == ISP_SEOF0) tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_SRC, selection);
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL, tmpVal);

}

void ISP_Intr_Ctrl_Get_Src(ISP_SEOF_E seof,ISP_Seof_Intr_Src_Type *selection)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL);
    if (seof == ISP_SEOF1) *selection = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF1_INT_SRC);
    else if (seof == ISP_SEOF2) *selection = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF2_INT_SRC);
    else if (seof == ISP_SEOF3) *selection = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF3_INT_SRC);
    else if (seof == ISP_SEOF4) *selection = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF4_INT_SRC);
    else if (seof == ISP_SEOF0) *selection = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_SRC);

}

#define YUV_SCALER_SET_STATE_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_BYPASS, !state);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE, tmpVal);}

void ISP_Scaler_Set_State(ISP_Scaler_Type type, BL_Fun_Type state)
{
    uint32_t tmpVal;

    if (ISP_SCALER_A == type) {
        YUV_SCALER_SET_STATE_MACRO(A)
    } else if (ISP_SCALER_B == type) {
        YUV_SCALER_SET_STATE_MACRO(B)
    } else if (ISP_SCALER_C == type) {
        YUV_SCALER_SET_STATE_MACRO(C)
    } else if (ISP_SCALER_D == type) {
        YUV_SCALER_SET_STATE_MACRO(D)
    }
    else {
        printf("YUV Scaler not support!\r\n");
    }
}

#define YUV_SCALER_SET_CONFIG_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_I_W, scaler_conf->input.width);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_I_H, scaler_conf->input.height);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE, tmpVal);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_O_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_O_W, scaler_conf->output.width);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_O_H, scaler_conf->output.height);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_O_SIZE, tmpVal);}

// TODO add interface to set scaler input, default is isp out
void ISP_Scaler_Set_Cfg(ISP_Scaler_Type type, ISP_SCALER_CONFIG_S *scaler_conf)
{
    uint32_t tmpVal;
    if (ISP_SCALER_A == type) {
        YUV_SCALER_SET_CONFIG_MACRO(A)
    } else if (ISP_SCALER_B == type) {
        YUV_SCALER_SET_CONFIG_MACRO(B)
    } else if (ISP_SCALER_C == type) {
        YUV_SCALER_SET_CONFIG_MACRO(C)
    } else if (ISP_SCALER_D == type) {
        YUV_SCALER_SET_CONFIG_MACRO(D)
    }
    else {
        printf("YUV Scaler not support!\r\n");
    }
}

