bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
void ISP_Frame_M_to_N(ISP_FRAME_M_TO_N_S *cfg)
{
    uint32_t frm_m_to_n;

    frm_m_to_n = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_FRAME_M_TO_N);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_M_TO_N_EN, cfg->enb);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_CNT_M, cfg->m);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_CNT_N, cfg->n);
    frm_m_to_n = BL_SET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_INTERVAL, cfg->intv);
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP_FRAME_M_TO_N, frm_m_to_n);
}

void ISP_Frame_Get_M_to_N(ISP_FRAME_M_TO_N_S *cfg)
{
    uint32_t frm_m_to_n;

    frm_m_to_n = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_FRAME_M_TO_N);
    cfg->enb  = BL_GET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_M_TO_N_EN);
    cfg->m    = BL_GET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_CNT_M);
    cfg->n    = BL_GET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_CNT_N);
    cfg->intv = BL_GET_REG_BITS_VAL(frm_m_to_n, ISP_MISC_CR_FRAME_INTERVAL);
}

void ISP_Enable_BL_ISP_Back(void)
{
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DUMMY, 1);
}

#define YUV_ADJUST_INIT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MUL0,  ISP_MISC_YUV_ADJUST_DEFAULT_Y_CONTRAST_MUL0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MUL1,  ISP_MISC_YUV_ADJUST_DEFAULT_Y_CONTRAST_MUL1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_LUMA,  ISP_MISC_YUV_ADJUST_DEFAULT_Y_BRIGHTNESS);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0, tmpVal);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MAX,  ISP_MISC_YUV_ADJUST_DEFAULT_UV_MAX);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MIN,  ISP_MISC_YUV_ADJUST_DEFAULT_UV_MIN);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MAX,   ISP_MISC_YUV_ADJUST_DEFAULT_Y_MAX);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MIN,   ISP_MISC_YUV_ADJUST_DEFAULT_Y_MIN);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_1, tmpVal);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MUL0,  ISP_MISC_YUV_ADJUST_DEFAULT_UV_STURATION_MUL0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MUL1,  ISP_MISC_YUV_ADJUST_DEFAULT_UV_STURATION_MUL1);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2, tmpVal);}

void ISP_YUV_Adjust_Init()
{
    uint32_t tmpVal;

    YUV_ADJUST_INIT_MACRO(A)
    YUV_ADJUST_INIT_MACRO(B)
    YUV_ADJUST_INIT_MACRO(C)
    YUV_ADJUST_INIT_MACRO(D)

    ISP_YUV_Adjust_Set_State(ISP_YUV_ADJUST_A, DISABLE);
    ISP_YUV_Adjust_Set_State(ISP_YUV_ADJUST_B, DISABLE);
    ISP_YUV_Adjust_Set_State(ISP_YUV_ADJUST_C, DISABLE);
    ISP_YUV_Adjust_Set_State(ISP_YUV_ADJUST_D, DISABLE);
}

#define YUV_ADJUST_SET_CFG_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MUL0,  cfg->y_mul0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MUL1,  cfg->y_mul1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_LUMA,  cfg->y_luma);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0, tmpVal);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_1);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MAX,  cfg->uv_max);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MIN,  cfg->uv_min);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MAX,   cfg->y_max);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MIN,   cfg->y_min);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_1, tmpVal);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MUL0,  cfg->uv_mul0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MUL1,  cfg->uv_mul1);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2, tmpVal);}

void ISP_YUV_Adjust_Set_Cfg(ISP_YUV_Adjust_Type type, ISP_YUV_Adjust_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    if (ISP_YUV_ADJUST_A == type) {
        YUV_ADJUST_SET_CFG_MACRO(A)
    } else if (ISP_YUV_ADJUST_B == type) {
        YUV_ADJUST_SET_CFG_MACRO(B)
    } else if (ISP_YUV_ADJUST_C == type) {
        YUV_ADJUST_SET_CFG_MACRO(C)
    } else if (ISP_YUV_ADJUST_D == type) {
        YUV_ADJUST_SET_CFG_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }

}

#define YUV_ADJUST_GET_CFG_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0);\
    cfg->y_mul0 = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MUL0);\
    cfg->y_mul1 = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MUL1);\
    cfg->y_luma = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_LUMA);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_1);\
    cfg->uv_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MAX);\
    cfg->uv_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MIN);\
    cfg->y_max = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MAX);\
    cfg->y_min = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_Y_MIN);\
    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2);\
    cfg->uv_mul0 = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MUL0);\
    cfg->uv_mul1 = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_UV_MUL1);}

void ISP_YUV_Adjust_Get_Cfg(ISP_YUV_Adjust_Type type, ISP_YUV_Adjust_Cfg_Type *cfg)
{
    uint32_t tmpVal;

    if (ISP_YUV_ADJUST_A == type) {
        YUV_ADJUST_GET_CFG_MACRO(A)
    } else if (ISP_YUV_ADJUST_B == type) {
        YUV_ADJUST_GET_CFG_MACRO(B)
    } else if (ISP_YUV_ADJUST_C == type) {
        YUV_ADJUST_GET_CFG_MACRO(C)
    } else if (ISP_YUV_ADJUST_D == type) {
        YUV_ADJUST_GET_CFG_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }

