bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
}

#define YUV_ADJUST_SET_STATE_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_ADJ_EB, state);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0, tmpVal);}

void ISP_YUV_Adjust_Set_State(ISP_YUV_Adjust_Type type, BL_Fun_Type state)
{
    uint32_t tmpVal;
    if (ISP_YUV_ADJUST_A == type) {
        YUV_ADJUST_SET_STATE_MACRO(A)
    } else if (ISP_YUV_ADJUST_B == type) {
        YUV_ADJUST_SET_STATE_MACRO(B)
    } else if (ISP_YUV_ADJUST_C == type) {
        YUV_ADJUST_SET_STATE_MACRO(C)
    } else if (ISP_YUV_ADJUST_D == type) {
        YUV_ADJUST_SET_STATE_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define YUV_ADJUST_GET_STATE_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_0);\
    *state = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_ADJ##name##_ADJ_EB);}

void ISP_YUV_Adjust_Get_State(ISP_YUV_Adjust_Type type, BL_Fun_Type *state)
{
    uint32_t tmpVal;
    if (ISP_YUV_ADJUST_A == type) {
        YUV_ADJUST_GET_STATE_MACRO(A)
    } else if (ISP_YUV_ADJUST_B == type) {
        YUV_ADJUST_GET_STATE_MACRO(B)
    } else if (ISP_YUV_ADJUST_C == type) {
        YUV_ADJUST_GET_STATE_MACRO(C)
    } else if (ISP_YUV_ADJUST_D == type) {
        YUV_ADJUST_GET_STATE_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define YUV_ADJUST_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_ADJ##name##_SEL, input);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2, tmpVal);}

void ISP_YUV_Adjust_Set_Input(ISP_YUV_Adjust_Type type, ISP_YUV_Adjust_Input input)
{
    uint32_t tmpVal;
    if (ISP_YUV_ADJUST_A == type) {
        YUV_ADJUST_SET_INPUT_MACRO(A)
    } else if (ISP_YUV_ADJUST_B == type) {
        YUV_ADJUST_SET_INPUT_MACRO(B)
    } else if (ISP_YUV_ADJUST_C == type) {
        YUV_ADJUST_SET_INPUT_MACRO(C)
    } else if (ISP_YUV_ADJUST_D == type) {
        YUV_ADJUST_SET_INPUT_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define YUV_ADJUST_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_ADJ##name##_CTRL_2);\
    *input = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_ADJ##name##_SEL);}

void ISP_YUV_Adjust_Get_Input(ISP_YUV_Adjust_Type type, ISP_YUV_Adjust_Input *input)
{
    uint32_t tmpVal;
    if (ISP_YUV_ADJUST_A == type) {
        YUV_ADJUST_GET_INPUT_MACRO(A)
    } else if (ISP_YUV_ADJUST_B == type) {
        YUV_ADJUST_GET_INPUT_MACRO(B)
    } else if (ISP_YUV_ADJUST_C == type) {
        YUV_ADJUST_GET_INPUT_MACRO(C)
    } else if (ISP_YUV_ADJUST_D == type) {
        YUV_ADJUST_GET_INPUT_MACRO(D)
    }
    else {
        printf("YUV Adjust not support!\r\n");
    }
}

#define SCALER_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_SEL, input);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE, tmpVal);}

void ISP_Scaler_Set_Input(ISP_Scaler_Type type, ISP_Scaler_Input input)
{
    uint32_t tmpVal;
    if (ISP_SCALER_A == type) {
        SCALER_SET_INPUT_MACRO(A)
    } else if (ISP_SCALER_B == type) {
        SCALER_SET_INPUT_MACRO(B)
    } else if (ISP_SCALER_C == type) {
        SCALER_SET_INPUT_MACRO(C)
    } else if (ISP_SCALER_D == type) {
        SCALER_SET_INPUT_MACRO(D)
    } else {
        BL_LOGE("Scaler type %d not support!\r\n", type);
    }
}

#define SCALER_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_SCALER##name##_I_SIZE);\
    *input = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SCALER##name##_SEL);}
            
void ISP_Scaler_Get_Input(ISP_Scaler_Type type, ISP_Scaler_Input *input)
{
    uint32_t tmpVal;
    if (ISP_SCALER_A == type) {
        SCALER_GET_INPUT_MACRO(A)
    } else if (ISP_SCALER_B == type) {
        SCALER_GET_INPUT_MACRO(B)
    } else if (ISP_SCALER_C == type) {
        SCALER_GET_INPUT_MACRO(C)
    } else if (ISP_SCALER_D == type) {
        SCALER_GET_INPUT_MACRO(D)
    } else {
        BL_LOGE("Scaler type %d not support!\r\n", type);
    }
}

#define OSD_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_OSD##name##_I_CTRL);\
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_OSD##name##_SEL, input);\
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_OSD##name##_I_CTRL, tmpVal);}

void ISP_OSD_Set_Input(ISP_OSD_Type type, ISP_OSD_Input input)
{
    uint32_t tmpVal;
    if ((ISP_OSD_A == type || ISP_OSD_C == type) && (input == ISP_OSD_INPUT_OSD_A || input == ISP_OSD_INPUT_OSD_C)) {
        printf("Input from OsdA and OsdC are only supported by OsdB and OsdD\r\n");
        return;
    }
    if (ISP_OSD_A == type) {
        OSD_SET_INPUT_MACRO(A)
    } else if (ISP_OSD_B == type) {
        OSD_SET_INPUT_MACRO(B)
    } else if (ISP_OSD_C == type) {
        OSD_SET_INPUT_MACRO(C)
    } else if (ISP_OSD_D == type) {
        OSD_SET_INPUT_MACRO(D)
    } else {
        BL_LOGE("OSD type %d not support!\r\n", type);
    }
}

#define OSD_GET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_OSD##name##_I_CTRL);\
    *input = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_OSD##name##_SEL);}

void ISP_OSD_Get_Input(ISP_OSD_Type type, ISP_OSD_Input *input)
{
    uint32_t tmpVal;
    if ((ISP_OSD_A == type || ISP_OSD_C == type) && (input == ISP_OSD_INPUT_OSD_A || input == ISP_OSD_INPUT_OSD_C)) {
        printf("Input from OsdA and OsdC are only supported by OsdB and OsdD\r\n");
        return;
    }
    if (ISP_OSD_A == type) {
        OSD_GET_INPUT_MACRO(A)
    } else if (ISP_OSD_B == type) {
        OSD_GET_INPUT_MACRO(B)
    } else if (ISP_OSD_C == type) {
        OSD_GET_INPUT_MACRO(C)
    } else if (ISP_OSD_D == type) {
        OSD_GET_INPUT_MACRO(D)
    } else {
        BL_LOGE("OSD type %d not support!\r\n", type);
    }
}

#define YUV2RGB_SET_INPUT_MACRO(name) \
    {tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_Y2R##name##_CONFIG_0);\
     tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_Y2R##name##_SEL, (input == ISP_YUV2RGB_INPUT_DISABLED) ? 0 : input);\
     tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_Y2R##name##_EN,  (input == ISP_YUV2RGB_INPUT_DISABLED) ? 0 : 1);\
     BL_WR_REG(ISP_MISC_BASE, ISP_MISC_Y2R##name##_CONFIG_0, tmpVal);}

void ISP_YUV2RGB_Set_Input(ISP_YUV2RGB_Type type, ISP_YUV2RGB_Input input)
{
    uint32_t tmpVal;

    if (ISP_YUV2RGB_A == type) {
        YUV2RGB_SET_INPUT_MACRO(A)
    } else {
        BL_LOGE("YUV2RGB type %d not support!\r\n", type);
    }
}

