bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_4);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_12_U,(yuv2rgbCfg->matrix12>>4));
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_20,yuv2rgbCfg->matrix20);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_21,yuv2rgbCfg->matrix21);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_4,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_5);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_22,yuv2rgbCfg->matrix22);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_5,tmpVal);

        /* Enable or disable function */
        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_0);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_0,BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_EN,yuv2rgbCfg->enable));

    }else if(yuv2rgbId == ISP_MISC_YUV2RGB_NORMAL_ID){
        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_PRE_0,yuv2rgbCfg->preOffset0);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_POS_0,yuv2rgbCfg->postOffset0);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_0,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_PRE_1,yuv2rgbCfg->preOffset1);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_POS_1,yuv2rgbCfg->postOffset1);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_1,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_PRE_2,yuv2rgbCfg->preOffset2);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_POS_2,yuv2rgbCfg->postOffset2);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_2,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_3);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_00,yuv2rgbCfg->matrix00);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_01,yuv2rgbCfg->matrix01);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_3,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_4);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_02,yuv2rgbCfg->matrix02);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_10,yuv2rgbCfg->matrix10);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_4,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_5);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_11,yuv2rgbCfg->matrix11);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_12,yuv2rgbCfg->matrix12);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_5,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_6);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_20,yuv2rgbCfg->matrix20);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_21,yuv2rgbCfg->matrix21);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_6,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_7);
        tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_MTX_22,yuv2rgbCfg->matrix22);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_7,tmpVal);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_0);
        BL_WR_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_0,BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_EN,yuv2rgbCfg->enable));
    }
}

void ISP_MISC_YUV2RGB_Get_Cfg(ISP_MISC_YUV2RGB_ID_Type yuv2rgbId,ISP_MISC_YUV2RGB_Cfg_Type* yuv2rgbCfg)
{
    uint32_t tmpVal;
    uint16_t temp_mtx_l, temp_mtx_u;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_YUV2RGB_ID_TYPE(yuv2rgbId));

    if(yuv2rgbId == ISP_MISC_YUV2RGB_DISPLAY_ID){
        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_0);
        yuv2rgbCfg->preOffset0 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_PRE_0);
        yuv2rgbCfg->preOffset1 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_PRE_1);
        yuv2rgbCfg->preOffset2 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_PRE_2);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_1);
        yuv2rgbCfg->postOffset0 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_POS_0);
        yuv2rgbCfg->postOffset1 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_POS_1);
        yuv2rgbCfg->postOffset2 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_POS_2);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_2);
        yuv2rgbCfg->matrix00 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_00);
        yuv2rgbCfg->matrix01 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_01);
        temp_mtx_l = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_02_L);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_3);
        temp_mtx_u = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_02_U);
        yuv2rgbCfg->matrix02 = (temp_mtx_u << 8) + temp_mtx_l;
        
        yuv2rgbCfg->matrix10 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_10);
        yuv2rgbCfg->matrix11 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_11);
        temp_mtx_l = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_12_L);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_4);
        temp_mtx_u = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_12_U);
        yuv2rgbCfg->matrix12 = (temp_mtx_u << 4) + temp_mtx_l;
        
        yuv2rgbCfg->matrix20 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_20);
        yuv2rgbCfg->matrix21 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_21);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_5);
        yuv2rgbCfg->matrix22 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_MTX_22);

        /* Enable or disable function */
        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_YUV_RGB_CONFIG_0);
        yuv2rgbCfg->enable = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_Y2R_EN);

    }else if(yuv2rgbId == ISP_MISC_YUV2RGB_NORMAL_ID){
        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_0);
        yuv2rgbCfg->preOffset0 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_PRE_0);
        yuv2rgbCfg->postOffset0 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_POS_0);

        tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_Y2RA_CONFIG_1);
        yuv2rgbCfg->preOffset1 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_PRE_1);
        yuv2rgbCfg->postOffset1 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_Y2RA_POS_1);

