bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_3);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_02_U,(rgb2yuvCfg->matrix02>>8));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_10,rgb2yuvCfg->matrix10);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_11,rgb2yuvCfg->matrix11);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_12_L,(rgb2yuvCfg->matrix12 & 0x3));
    BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_3,tmpVal);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_4);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_12_U,(rgb2yuvCfg->matrix12>>4));
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_20,rgb2yuvCfg->matrix20);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_21,rgb2yuvCfg->matrix21);
    BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_4,tmpVal);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_5);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_22,rgb2yuvCfg->matrix22);
    BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_5,tmpVal);

    /* Enable or disable function */
    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_0);
    BL_WR_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_0,BL_SET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_EN,rgb2yuvCfg->enable));

}

void ISP_MISC_Display_RGB2YUV_Get_Cfg(ISP_MISC_RGB2YUV_Cfg_Type* rgb2yuvCfg)
{
    uint32_t tmpVal;
    uint16_t temp_mtx_l, temp_mtx_u;

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_0);
    rgb2yuvCfg->preOffset0 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_PRE_0);
    rgb2yuvCfg->preOffset1 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_PRE_1);
    rgb2yuvCfg->preOffset2 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_PRE_2);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_1);
    rgb2yuvCfg->postOffset0 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_POS_0);
    rgb2yuvCfg->postOffset1 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_POS_1);
    rgb2yuvCfg->postOffset2 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_POS_2);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_2);
    rgb2yuvCfg->matrix00 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_00);
    rgb2yuvCfg->matrix01 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_01);
    temp_mtx_l = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_02_L);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_3);
    temp_mtx_u = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_02_U);
    rgb2yuvCfg->matrix02 = (temp_mtx_u << 8) + temp_mtx_l;
    
    rgb2yuvCfg->matrix10 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_10);
    rgb2yuvCfg->matrix11 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_11);
    temp_mtx_l = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_12_L);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_4);
    temp_mtx_u = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_12_U);
    rgb2yuvCfg->matrix12 = (temp_mtx_u << 4) + temp_mtx_l;
    
    rgb2yuvCfg->matrix20 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_20);
    rgb2yuvCfg->matrix21 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_21);

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_5);
    rgb2yuvCfg->matrix22 = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_MTX_22);

    /* Enable or disable function */
    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_DISP_RGB2YUV_CONFIG_0);
    rgb2yuvCfg->enable = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_RG_DISP_R2Y_EN);
}

/****************************************************************************//**
 * @brief  Crop init
 *
 * @param  cropId: Crop id
 * @param  cropCfg: Crop configuration structure pointer
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_Crop_Init(ISP_MISC_Crop_ID_Type cropId, ISP_MISC_Crop_Cfg_Type* cropCfg)
{
    uint32_t cropAddr = ISP_MISC_BASE+ISP_MISC_CROPA_HSYNC_OFFSET+8*cropId;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_CROP_ID_TYPE(cropId));

    BL_WR_WORD(cropAddr,cropCfg->hsyncEnd<<16|cropCfg->hsyncStart);
    cropAddr += 4;
    BL_WR_WORD(cropAddr,cropCfg->vsyncEnd<<16|cropCfg->vsyncStart);
}

void ISP_MISC_Crop_Get_Cfg(ISP_MISC_Crop_ID_Type cropId, ISP_MISC_Crop_Cfg_Type* cropCfg)
{
    uint32_t tmpVal;
    uint32_t cropAddr = ISP_MISC_BASE+ISP_MISC_CROPA_HSYNC_OFFSET+8*cropId;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_WORD(cropAddr);
    cropCfg->hsyncStart = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_REG_CROPA_HSYNC_START);
    cropCfg->hsyncEnd = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_REG_CROPA_HSYNC_END);

    cropAddr += 4;
    tmpVal = BL_RD_WORD(cropAddr);
    cropCfg->vsyncStart = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_REG_CROPA_VSYNC_START);
    cropCfg->vsyncEnd = BL_GET_REG_BITS_VAL(tmpVal,ISP_MISC_REG_CROPA_VSYNC_END);
}

/****************************************************************************//**
 * @brief  Crop enable
 *
 * @param  cropId: Crop id
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_Crop_Enable(ISP_MISC_Crop_ID_Type cropId)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_CROP_ENABLE);
    switch(cropId){
        case ISP_MISC_CROP_0_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,ISP_MISC_REG_CROPA_ENABLE);
            break;
        case ISP_MISC_CROP_1_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,ISP_MISC_REG_CROPB_ENABLE);
            break;
        case ISP_MISC_CROP_2_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,ISP_MISC_REG_CROPC_ENABLE);
            break;
        case ISP_MISC_CROP_3_ID:
            tmpVal = BL_SET_REG_BIT(tmpVal,ISP_MISC_REG_CROPD_ENABLE);
            break;
        default:
            break;
    }
    BL_WR_REG(ISP_MISC_BASE,ISP_MISC_CROP_ENABLE,tmpVal);
}

/****************************************************************************//**
 * @brief  Crop disable
 *
 * @param  cropId: Crop id
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_Crop_Disable(ISP_MISC_Crop_ID_Type cropId)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_CROP_ENABLE);
    switch(cropId){
        case ISP_MISC_CROP_0_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,ISP_MISC_REG_CROPA_ENABLE);
            break;
        case ISP_MISC_CROP_1_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,ISP_MISC_REG_CROPB_ENABLE);
            break;
        case ISP_MISC_CROP_2_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,ISP_MISC_REG_CROPC_ENABLE);
            break;
        case ISP_MISC_CROP_3_ID:
            tmpVal = BL_CLR_REG_BIT(tmpVal,ISP_MISC_REG_CROPD_ENABLE);
            break;
        default:
            break;
    }
    BL_WR_REG(ISP_MISC_BASE,ISP_MISC_CROP_ENABLE,tmpVal);
}

void ISP_MISC_Crop_Get_State(ISP_MISC_Crop_ID_Type cropId, BL_Fun_Type *state)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_CROP_ID_TYPE(cropId));

    tmpVal = BL_RD_REG(ISP_MISC_BASE,ISP_MISC_CROP_ENABLE);
    switch(cropId){
        case ISP_MISC_CROP_0_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_CROPA_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case ISP_MISC_CROP_1_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_CROPB_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case ISP_MISC_CROP_2_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_CROPC_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        case ISP_MISC_CROP_3_ID:
            if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_CROPD_ENABLE)) {
                *state = ENABLE;
            } else {
                *state = DISABLE;
            }
            break;
        default:
            break;
    }
}

