bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
void ISP_MISC_Reshape_Set_State(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_EN);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_EN);
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE, tmpVal);
}

void ISP_MISC_Reshape_Get_State(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);
    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_RSHP_EN)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_MISC_Reshape_Counter_Clear()
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);
    tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_CLR);
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE, tmpVal);
}

void ISP_MISC_Reshape_Set_Counter(int value)
{
    uint32_t tmpVal;

    CHECK_PARAM_RANGE(value, ISP_MISC_RESHAPE_TOGGLE_COUNT_MIN, ISP_MISC_RESHAPE_TOGGLE_COUNT_MAX);

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);
    tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_RSHP_TGL_COUNT, value);
    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE, tmpVal);
}

void ISP_MISC_Reshape_Get_Counter(int *value)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);
    *value = BL_GET_REG_BITS_VAL(tmpVal, ISP_MISC_REG_RSHP_TGL_COUNT);
}

void ISP_MISC_Reshape_Set_HSync_Inv(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_HSYNC_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_HSYNC_INV);
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE, tmpVal);
}

void ISP_MISC_Reshape_Get_HSync_Inv(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_RSHP_HSYNC_INV)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }
}

void ISP_MISC_Reshape_Set_VSync_Inv(BL_Fun_Type state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);

    if (ENABLE == state) {
        tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_VSYNC_INV);
    } else {
        tmpVal = BL_CLR_REG_BIT(tmpVal, ISP_MISC_REG_RSHP_VSYNC_INV);
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE, tmpVal);
}

void ISP_MISC_Reshape_Get_VSync_Inv(BL_Fun_Type *state)
{
    uint32_t tmpVal;

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_DVP_RESHAPE);

    if (BL_IS_REG_BIT_SET(tmpVal, ISP_MISC_REG_RSHP_VSYNC_INV)) {
        *state = ENABLE;
    } else {
        *state = DISABLE;
    }

}


/****************************************************************************/ /**
 * @brief  Select SEOF interrupt vsync source
 *
 * @param  intType: SEOF interrupt type
 * @param  source: SEOF interrupt vsync source type
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_SEOF_Set_Source(ISP_MISC_INT_Type intType, ISP_MISC_SEOF_Source_Type source)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_INT_TYPE(intType));
    CHECK_PARAM(IS_ISP_MISC_SEOF_SOURCE_TYPE(source));

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL);

    switch (intType) {
        case ISP_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF1_INT_SRC, source);
            break;

        case ISP_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF2_INT_SRC, source);
            break;

        case ISP_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF3_INT_SRC, source);
            break;

        case ISP_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_SRC, source & 0x1);
            break;

        case ISP_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF4_INT_SRC, source);
            break;

        default:
            return;
            break;
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL, tmpVal);
}


/****************************************************************************/ /**
 * @brief  Select SEOF interrupt vsync source
 *
 * @param  intType: SEOF interrupt type
 * @param  edge: SEOF interrupt edge type
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_SEOF_Set_Edge(ISP_MISC_INT_Type intType, ISP_MISC_SEOF_Edge_Type edge)
{
    uint32_t tmpVal;

    /* Check the parameters */
    // CHECK_PARAM(IS_ISP_MISC_INT_TYPE(intType));
    // CHECK_PARAM(IS_ISP_MISC_SEOF_EDGE_TYPE(edge));

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL);

    switch (intType) {
        case ISP_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF1_INT_EDGE, edge);
            break;

        case ISP_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF2_INT_EDGE, edge);
            break;

        case ISP_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF3_INT_EDGE, edge);
            break;

        case ISP_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_EDGE, edge);
            break;

        case ISP_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF4_INT_EDGE, edge);
            break;

        default:
            return;
            break;
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL, tmpVal);
}
/****************************************************************************/ /**
 * @brief  Mask/Unmask certain or all of the interrupt
 *
 * @param  intType: Interrupt type
 * @param  intMask: Mask or unmask
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_Int_Mask(ISP_MISC_INT_Type intType, BL_Mask_Type intMask)
{
    uint32_t tmpVal;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_INT_TYPE(intType));
    CHECK_PARAM(IS_BL_MASK_TYPE(intMask));

    tmpVal = BL_RD_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL);

    switch (intType) {
#if 1
        case ISP_MISC_INT_AWB0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_AWB_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_AE:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_AE_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_WDR:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_WDR_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_AWB1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_AWB2_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_OSD_PB:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_OSD_PB_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF1_INT_MASK, intMask);
            break;

