bouffalolab/bl_iot_sdk/components/platform/soc/bl808/bl808_std/BL808_BSP_Driver/StdDriver/Src/bl808_cam_misc.c
        case ISP_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF2_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF3_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_AE_HIST:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_AE_HIST_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_AWB2:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_AWB3_INT_MASK, intMask);
            break;
#endif
        case ISP_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BITS_VAL(tmpVal, ISP_MISC_RG_SEOF4_INT_MASK, intMask);
            break;

        case ISP_MISC_INT_ALL:
            if (intMask == MASK) {
                tmpVal |= 0x1131111f;
            } else {
                tmpVal &= ~0x1131111f;
            }

            break;

        default:
            break;
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CTRL, tmpVal);
}
#if 1
/****************************************************************************/ /**
 * @brief  Clear certain or all of the interrupt
 *
 * @param  intType: Interrupt type
 *
 * @return None
 *
*******************************************************************************/
void ISP_MISC_Int_Clear_1(ISP_MISC_INT_Type intType)
{
    uint32_t tmpVal = 0;

    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_INT_TYPE(intType));

    switch (intType) {
#if 1
        case ISP_MISC_INT_AWB0:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AWB_INT_CLR);
            break;

        case ISP_MISC_INT_AE:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AE_INT_CLR);
            break;

        case ISP_MISC_INT_WDR:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_WDR_INT_CLR);
            break;

        case ISP_MISC_INT_AWB1:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AWB2_INT_CLR);
            break;

        case ISP_MISC_INT_OSD_PB:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_OSD_PB_INT_CLR);
            break;

        case ISP_MISC_INT_SEOF0:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF1_INT_CLR);
            break;

        case ISP_MISC_INT_SEOF1:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF2_INT_CLR);
            break;

        case ISP_MISC_INT_SEOF2:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF3_INT_CLR);
            break;

        case ISP_MISC_INT_AE_HIST:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AE_HIST_INT_CLR);
            break;

        case ISP_MISC_INT_AWB2:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_AWB3_INT_CLR);
            break;
#endif
        case ISP_MISC_INT_DISPLAY:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_DP_SEOF0_INT_CLR);
            break;

        case ISP_MISC_INT_SEOF3:
            tmpVal = BL_SET_REG_BIT(tmpVal, ISP_MISC_RG_SEOF4_INT_CLR);
            break;

        case ISP_MISC_INT_ALL:
            tmpVal = 0x7f1f;
            break;

        default:
            break;
    }

    BL_WR_REG(ISP_MISC_BASE, ISP_MISC_INT_CLR, tmpVal);
}
/*@} end of group ISP_MISC_Private_Types */
#endif
/** @defgroup  ISP_MISC_Private_Variables
 *  @{
 */
//#ifndef BFLB_USE_HAL_DRIVER
static intCallback_Type *ispMiscIntCbfArra[ISP_MISC_INT_ALL] = {
    NULL
};
//#endif

/****************************************************************************/ /**
 * @brief  Display interrupt handler
 *
 * @param  None
 *
 * @return None
 *
*******************************************************************************/
//#ifndef BFLB_USE_HAL_DRIVER
void Display_IRQHandler(void)
{
    ISP_MISC_Int_Clear_1(ISP_MISC_INT_DISPLAY);

    if (ispMiscIntCbfArra[ISP_MISC_INT_DISPLAY] != NULL) {
        ispMiscIntCbfArra[ISP_MISC_INT_DISPLAY]();
    }
}
//#endif
#if 1

/****************************************************************************/ /**
 * @brief  Install isp misc interrupt callback function
 *
 * @param  intType: ISP misc interrupt type
 * @param  cbFun: Pointer to interrupt callback function. The type should be void (*fn)(void)
 *
 * @return None
 *
*******************************************************************************/
//#ifndef BFLB_USE_HAL_DRIVER
void ISP_MISC_Int_Callback_Install(ISP_MISC_INT_Type intType, intCallback_Type *cbFun)
{
    /* Check the parameters */
    CHECK_PARAM(IS_ISP_MISC_INT_TYPE(intType));

    switch (intType) {
#if 0
#if defined(CPU_D0)

        case ISP_MISC_INT_AWB0:
            Interrupt_Handler_Register(ISP_AWB0_IRQn, AWB0_IRQHandler);
            break;
#endif

        case ISP_MISC_INT_AE:
            Interrupt_Handler_Register(ISP_AE_IRQn, AE_IRQHandler);
            break;

        case ISP_MISC_INT_WDR:
            Interrupt_Handler_Register(ISP_WDR_IRQn, WDR_IRQHandler);
            break;

        case ISP_MISC_INT_AWB1:
            Interrupt_Handler_Register(ISP_AWB1_IRQn, AWB1_IRQHandler);
            break;

        case ISP_MISC_INT_OSD_PB:
            Interrupt_Handler_Register(OSD_PB_IRQn, OSD_PB_IRQHandler);
            break;

        case ISP_MISC_INT_SEOF0:
            Interrupt_Handler_Register(SEOF_INT0_IRQn, SEOF0_IRQHandler);
            break;

        case ISP_MISC_INT_SEOF1:
            Interrupt_Handler_Register(SEOF_INT1_IRQn, SEOF1_IRQHandler);
            break;

        case ISP_MISC_INT_SEOF2:
            Interrupt_Handler_Register(SEOF_INT2_IRQn, SEOF2_IRQHandler);
            break;

        case ISP_MISC_INT_AE_HIST:
            Interrupt_Handler_Register(ISP_AE_HIST_IRQn, AE_HIST_IRQHandler);
            break;

        case ISP_MISC_INT_AWB2:
            Interrupt_Handler_Register(ISP_AWB2_IRQn, AWB2_IRQHandler);
            break;
#endif
        case ISP_MISC_INT_DISPLAY:
            Interrupt_Handler_Register(DISPLAY_IRQn, Display_IRQHandler);
            break;
#if 0
        case ISP_MISC_INT_SEOF3:
            Interrupt_Handler_Register(SEOF_INT3_IRQn, SEOF3_IRQHandler);
            break;
#endif
        default:
            break;
    }

    ispMiscIntCbfArra[intType] = cbFun;
}
#endif
//#endif